{
  "backend/main.mo": "Motoko canister handling user onboarding, profiles, connections, messaging, and call request state with access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for documentation and build planning.",
  "frontend/index.css": "Global Tailwind styles defining light/dark OKLCH color system and base layout rules.",
  "frontend/index.html": "HTML entry point mounting the React app and linking the LensGram icon.",
  "frontend/src/App.tsx": "Main router and authentication/onboarding gating logic for all app pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with React Query cache clearing.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing screen shown to unauthenticated users with branding and login prompt.",
  "frontend/src/components/calls/CallRequestPanel.tsx": "UI panel for initiating, accepting, declining, and ending call requests between users.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main page layout with header, navigation, footer, and dynamic child content.",
  "frontend/src/components/layout/PrimaryNav.tsx": "Renders top navigation buttons and highlights the active route using TanStack Router.",
  "frontend/src/components/users/UserResultCard.tsx": "Displays a user's profile card with connection status and actions such as sending or viewing requests.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCallRequests.ts": "Provides hooks to query call state and perform call actions like initiate, accept, decline, and end.",
  "frontend/src/hooks/useChat.ts": "Handles fetching messages for a chat and sending new messages with automatic query invalidation.",
  "frontend/src/hooks/useConnectionRequests.ts": "Manages connection requests, including fetching pending requests, profiles, sending, accepting, rejecting, and checking status.",
  "frontend/src/hooks/useConnections.ts": "Fetches user connections and their profiles, plus retrieving a single user's profile by principal.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Retrieves the currently authenticated user's profile and provides an onboarding mutation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Exposes a simple readiness check for when the backend actor is available.",
  "frontend/src/hooks/useUserSearch.ts": "Queries the backend for a user profile by username, returning null for empty searches.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/ChatDetailPage.tsx": "Chat view showing messages with a user, sending new messages, and handling navigation and calls.",
  "frontend/src/pages/ChatsPage.tsx": "Lists user connections and lets users open individual chat threads.",
  "frontend/src/pages/DiscoverPage.tsx": "Provides username search and displays user search results.",
  "frontend/src/pages/OnboardingPage.tsx": "User onboarding form for display name, email, and username creation.",
  "frontend/src/pages/RequestsPage.tsx": "Displays pending connection requests with accept and decline actions.",
  "frontend/src/utils/time.ts": "Utilities for formatting timestamps and message times into human-readable strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and remove them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Describes the project’s state, versions, required features, and image requirements for the LensGram app."
}