{
  "kind": "build_request",
  "title": "Fix account creation showing 'Failed to login' during onboarding",
  "projectName": "LensGram",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Fix the authenticated actor initialization so that a normal end-user can log in and complete onboarding without requiring an admin token or triggering an authorization trap.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when we are creating account it's showing failed to login"
        ]
      },
      "acceptanceCriteria": [
        "A newly authenticated user (Internet Identity) can reach the onboarding form and submit it successfully without any 'Failed to login' error.",
        "The frontend must not call privileged initialization APIs (e.g., access-control secret init) when the required secret parameter is missing/empty.",
        "If a privileged initialization call fails, the failure must not break normal user login/onboarding; it should be skipped or handled gracefully."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Ensure the backend access control permits first-time users to onboard after Internet Identity login, without requiring any manual/admin-only initialization step.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when we are creating account it's showing failed to login"
        ]
      },
      "acceptanceCriteria": [
        "A principal that has authenticated via Internet Identity can call the onboarding flow successfully in a fresh browser session.",
        "If the backend currently requires a permission (e.g., #user) for onboarding, the backend must reliably grant/recognize that permission for authenticated end-users prior to onboarding (without exposing admin privileges).",
        "Unauthorized traps must not occur for first-time onboarding when the caller is a valid authenticated principal."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Improve user-facing error handling in the onboarding/account-creation flow so login errors and profile-creation errors are distinguished and shown with clear English messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when we are creating account it's showing failed to login"
        ]
      },
      "acceptanceCriteria": [
        "Onboarding page shows a clear error message when profile creation fails, without mislabeling it as a login failure.",
        "If the backend returns an authorization/unauthorized error, the UI instructs the user to re-login (e.g., 'Your session expired. Please sign in again.').",
        "If the backend returns 'Username taken', the existing specific message remains correct and is still shown."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity.",
    "Adding profile images or other new onboarding fields.",
    "Changing the overall navigation or adding new pages unrelated to fixing login/onboarding reliability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}