{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "LensGram: Fix onboarding login failure caused by privileged actor initialization",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Stop privileged access-control initialization from breaking normal Internet Identity login/onboarding; only run it when a valid secret is present and handle failures gracefully.",
      "acceptanceCriteria": [
        "A newly authenticated user (Internet Identity) can reach the onboarding form and submit it successfully without any 'Failed to login' error.",
        "The frontend must not call privileged initialization APIs (e.g., access-control secret init) when the required secret parameter is missing/empty.",
        "If a privileged initialization call fails, the failure must not break normal user login/onboarding; it should be skipped or handled gracefully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Update authenticated actor initialization to (1) only attempt the authorization component's privileged initialization when the secret token exists and is non-empty, and (2) wrap that privileged call in try/catch so failures do not prevent returning a usable authenticated actor for normal users. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust app gating so actor/profile-loading failures are not misrepresented as login failures and do not block authenticated users from reaching onboarding when they have a valid Internet Identity session; rely on the authorization component’s guidance for handling authorization traps gracefully. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Improve onboarding error messages to clearly distinguish login/session issues from profile-creation issues while keeping the existing 'Username taken' messaging.",
      "acceptanceCriteria": [
        "Onboarding page shows a clear error message when profile creation fails, without mislabeling it as a login failure.",
        "If the backend returns an authorization/unauthorized error, the UI instructs the user to re-login (e.g., 'Your session expired. Please sign in again.').",
        "If the backend returns 'Username taken', the existing specific message remains correct and is still shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/onboardingErrors.ts",
          "operation": "create",
          "description": "Create a small helper to normalize and classify onboarding-related errors (e.g., unauthorized/session-expired vs username-taken vs generic profile-creation failure) into clear English strings for display, including detection for authorization trap messages; keep it frontend-only."
        },
        {
          "path": "frontend/src/hooks/useCurrentUserProfile.ts",
          "operation": "modify",
          "description": "Enhance the onboarding mutation error handling to preserve/propagate actionable error information (e.g., unauthorized vs username taken) in a way the UI can reliably render distinct messages; keep React Query invalidation behavior intact."
        },
        {
          "path": "frontend/src/pages/OnboardingPage.tsx",
          "operation": "modify",
          "description": "Use the new onboarding error helper to render clear, specific error messages: keep the existing 'Username taken' text, show a re-login instruction for authorization/unauthorized errors, and otherwise show a plain-English profile creation failure message (not a login failure)."
        }
      ]
    }
  ]
}